app/graphql/resolvers/add_to_cart.rb

  def call(obj, args, ctx)
    user = User.find(args[:user_id])
    cart = user.cart
    if cart.cart_items.exists?(product_id: args[:product_id])
      cart_item = cart.cart_items.find_by! product_id: args[:product_id]
      cart_item.quantity += args[:quantity]
      cart_item.save
    else
      cart_item = CartItem.create(product_id: args[:product_id], quantity: args[:quantity])
      cart.cart_items << cart_item
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 444699983], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 444699983], ["LIMIT", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 765667028], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 765667028], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 15], ["updated_at", "2019-01-26 16:20:39.153403"], ["id", 231840619]]
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 382888467], ["product_id", 443992471], ["quantity", 5], ["created_at", "2019-01-26 16:28:44.739765"], ["updated_at", "2019-01-26 16:28:44.739765"]]