app/graphql/resolvers/edit_cart_item_quantity.rb

  def call(obj, args, ctx)
    user = User.find(args[:user_id])
    cart = user.cart
    if cart.cart_items.exists?(product_id: args[:product_id])
      if args[:quantity] <= 0
        cart.cart_items.delete(cart.cart_items.find_by! product_id: args[:product_id])
        cart.save
      else
        cart_item = cart.cart_items.find_by! product_id: args[:product_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 444699983], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 444699983], ["LIMIT", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 443992471], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 443992471], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 10], ["updated_at", "2019-01-26 16:44:31.108114"], ["id", 987147270]]