app/graphql/resolvers/empty_cart.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 444699983], ["LIMIT", 1]]
UPDATE "cart_items" SET "cart_id" = NULL WHERE "cart_items"."cart_id" = ?  [["cart_id", 382888467]]
---
  def call(obj, args, ctx)
    user = User.find(args[:user_id])
    cart = user.cart
    cart.cart_items.delete_all
    cart.save