app/graphql/resolvers/purchase_products.rb

  def call(obj, args, ctx)
    products = Product.find(args[:ids])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]