app/graphql/resolvers/remove_from_cart.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 444699983], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 444699983], ["LIMIT", 1]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 443992471], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 382888467], ["product_id", 443992471], ["LIMIT", 1]]
UPDATE "cart_items" SET "cart_id" = NULL WHERE "cart_items"."cart_id" = ? AND "cart_items"."id" = ?  [["cart_id", 382888467], ["id", 987147267]]
---
  def call(obj, args, ctx)
    user = User.find(args[:user_id])
    cart = user.cart
    if cart.cart_items.exists?(product_id: args[:product_id])
      cart.cart_items.delete(cart.cart_items.find_by! product_id: args[:product_id])
      cart.save