app/graphql/types/cart_type.rb

    field :products do
      type types[Types::ProductType]
      resolve -> (cart, args, ctx) {
        Product.find(cart.productsid)
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?)  [["id", 1], ["id", 3]]