app/graphql/types/query_type.rb

  field :user_by_id, Types::UserType do
    argument :id, !types.ID
    resolve -> (obj, args, ctx) {
      User.find(args[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  field :user_by_username, Types::UserType do
    argument :username, !types.String
    resolve -> (obj, args, ctx) {
      User.find_by! username: args[:username]
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "timweri"], ["LIMIT", 1]]

  field :product, Types::ProductType do
    argument :id, !types.ID
    resolve -> (obj, args, ctx) {
      Product.find(args[:id])
---
SELECT  "products".* FROM "products" WHERE (title = 'Shirt 1') ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]

      if args[:only_show_available]
        Product.where('inventory_count > ?', 0)
      else
        Product.all
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]